[
  {
    "path": "tei/said-element/",
    "title": "`<said>` Element",
    "description": "Use of the `<said>` element in this project.",
    "author": [
      {
        "name": "Mathieu Glachant",
        "url": {}
      }
    ],
    "date": "2022-10-04",
    "categories": [],
    "contents": "\n\nContents\nWhat Is <said> For?\nGet the Data\nDownload\nLast Updated\nEditing Progress\n\nMaking Sense of the Data\nbook\nchapter\npage\nline\nspeaker\naddressee\nperson\norg\nplace\nlanguage\naloud\nformat\nwords\n\n\n\n\n\n\n\n\nWhat Is <said> For?\nThis project uses the TEI <said> element to mark up passages of the text that represent direct communication between characters. I usually refer to such passages as a ‘line of dialog’ or ‘line’ for short.\nA line between Mycroft and Dominic would be encoded as an XML node, thus:\n<p>\n  <said>\"Where hast thou been, stray?\"<\/said>\n    , Dominic snarled.\n<\/p>\nAdditional information about such passages can be retrieved in various ways, see details below.\nGet the Data\nDownload\nThe data extracted from the Digital Edition’s <said> nodes is available as a CSV file.\n\n\n\n\nDownload the data\nLast Updated\nThis file was last updated on 2022-10-06.\nEditing Progress\n\n\nToo Like the Lightning\n    Editing Progress\n    Chapter\n      Progress\n      \n        Missing\n      \n    speaker\n      addressee\n    1\n100%\n-\n-2\n100%\n-\n-3\n100%\n-\n-4\n100%\n-\n-5\n100%\n-\n-6\n100%\n-\n-7\n100%\n-\n-8\n100%\n-\n-9\n100%\n-\n-10\n100%\n-\n-11\n100%\n-\n-12\n100%\n-\n-\n\nMaking Sense of the Data\nA lot of additional information about each line of dialog is encoded beyond its content.\nWhat follows is a data dictionary, explaining the contents of the file. How they are generated, what they mean, with some simple examples of what you can do with them.\nbook\nThe number of the book containing the line.\nRequired, numeric.\nDerived from parameter n of the <text type=\"book\"> node the line is a child of.\n\n\nunique(said$book)\n\n[1] 1\n\nchapter\nThe number of the chapter containing the line.\nRequired, numeric.\nDerived from parameter n of the <div type=\"chapter\"> node the line is a child of.\n\n\n\npage\nThe number of the page on which the line starts.\nRequired, numeric.\nDerived from parameter n of the <pb/> milestone node which precedes the line in document order.\n\n\n\nline\nThe number of the actual line of dialog in the original text, unique across all four books.\nRequired, numeric.\nIf it is important to count or visualize the data by lines in the original text, the data should be nested first by the columns from speaker to place.\n\n\n\nMultiple Rows Per Line\nIn accordance with the Tidy Data paradigm1, since a line of dialog can have multiple speakers, addressees, etc… it may be represented by multiple rows in the data.\nThere are currently 4994 lines of dialog in the data but there are 5884 rows.\nline Can Change Between Releases!\nThe line value is assigned dynamically by the Xquery when the file is generated, not embedded in the text as markup. Therefore it can change between releases.\nspeaker\nThe unique identifier of the character speaking the line.\nRequired, NA indicates the line has not been edited2.\nDerived from parameter Who of the line’s <said> node, broken out to multiple rows if it contained a space-delimited list of values.\n\n\n\nCharacter IDs\nThe identifier takes the form #Mycroft or #Carlyle. It points to a unique <person> node with the xml:id parameter set to that value.\nThose <person> nodes contain metadata about the character, e.g. names, affiliations, age, etc… and are stored outside the text in a <standoff> node within the Digital Edition’s file.\nI will, at some point, publish the list of characters as its own file and the primary key will be this identifier to permit joins.\n‘Unknown’ Characters\nIt is not always clear in the text who is speaking, e.g. when Carlyle first overhears thru Thisbe’s door in Chapter the First, or the speaker is an unnamed individual in a crowd or group, e.g. the several services who witness Vivien dragging Mycroft out of the gutter in Chapter the Sixth.\nFor such cases, I use generic IDs with the form #Unknown-Soldier or #Unknown-Servicer or the fallback #Unknown.\naddressee\nThe unique identifier of the character the line is being spoken to.\nRequired, NA indicates the line has not been edited.\nDerived from the parameter ToWhom of the line’s <said> node, broken out to multiple rows if it contained a space-delimited list of values. See speaker for format and meaning of the identifier.\n\n\n\nAsides to the Reader\nThe text does not call out Mycroft’s asides to his gentle reader typographically. I have therefore had to make some editorial choices in marking up those parts of the text which are set like the rest of Mycroft’s narration but which I believe to be such an aside using the <said> element.\nThis allows me to include the conversations between Mycroft and the reader in this data, but at the cost of some personal interpretation in what does or does not make the cut.\nThe rule I’ve tried to follow is that narration that uses the second person and/or addresses the reader directly should be included. Usually I have found that once this pattern starts it persists to the end of the paragraph. Some individual cases are less clear-cut, and of course I will have made errors during the editing.\nperson\nThe unique identifier of a person mentioned by name in the line.\nOptional, NA indicates no was mentioned in the line.\nDerived from the ref parameter of any children <persName> nodes of the line, broken out to multiple rows if there is more than one. See speaker for format and meaning of the identifier.\n\n\n\norg\nThe unique identifier of an organization or group mentioned by name in the line.\nOptional, NA indicates no organization was mentioned in the line.\nDerived from the ref parameter of any children <orgName> nodes of the line, broken out to multiple rows if there is more than one.\n\n\n\nOrg IDs\nThe organizations are managed much like the characters, but using <org> nodes instead of <person>. Unlike persons, orgs can nest.\nThese include Hives, bash’es, nation strats, the servicers, or the Chicago Museum of Science and Industry with its Junior Scientist Club.\nplace\nThe unique identifier of a place mentioned by name in the line.\nOptional, NA indicates no place was mentioned in the line.\nDerived from the ref parameter of any children <placeName> nodes of the line, broken out to multiple rows if there is more than one.\n\n\n\nPlace IDs\nPlaces are managed much like orgs, but using <place> nodes instead of <org>.\nThese include planets, continents, cities, bash’houses, palaces, or flower trenches.\nlanguage\nThe ISO-code for the language the line is spoken in.\nRequired, but the file defaults to en-en since Mycroft’s typographic conventions allowed a programmatic approach to setting the attribute in the text.\nDerived from the xml:lang parameter of the line’s <said> node.\nNote that this is not the language of the line in the text itself, since Mycroft takes it upon himself to translate most of the dialog into English. Instead it is inferred from Mycroft’s typographical convention to represent the original language via the style of quotation marks used, or sometimes given directly by Mycroft in the narration.\n\n\n\nFuture ISO Language Codes\nSeveral of the languages spoken are future, invented variant of existing ones. In that spirit, I have created fictitious ISO codes for this parameter:\nen-ar: archaic English, as used by the reader and Dominic,\nsp-hu: Humanist Spanish,\njp-mi: Mitsubishi Japanese, on the premise that Ando makes little distinction betweent voting bloc and strat,\nfr-eu: European French,\nen-tx: the uncapitalized unpunctuated form of text only english used by eureka weeksbooth\nla-ma: Masonic neo-latin.\nOthers to come as they appear in the text, such as Ute-Speak as a dialect of English. When the text does not imply or affirm otherwise, I have used en-en as the language code for default English\nNon-English Languages in the Text\nI have used the <foreign xml:lang=\"fr-eu\"> element to wrap text that is actually given in a language other than English, e.g. here in European French, but I am not including this information in this data file. Create a feature request on the project GitHub repository if you’d like me to revisit that decision.\naloud\nA boolean that indicates whether the line is spoken aloud or not. Takes the value FALSE when texting, or between Mycroft and the reader, for example.\nRequired, but the file defaults to TRUE when the attribute has not been set in the text.\nDerived from the aloud parameter of the line’s <said> node.\n\n\n\nformat\nThe style in which the dialog is rendered in the text. Takes the value script when the layout changes to a script-like format with the speaker’s name repeated at each line, and novel otherwise.\nRequired, NA indicates a <said> element which does not match the criteria below.\nDerived from whether the ancestor of the line just below the chapter <div> level is a <p> node (novel format) or an <sp> node (script format).\n\n\n\nwords\nThe number of words in the line.\nRequired, numeric.\nDerived by counting the normalized spaces in the line, plus one. Faster than tokenizing and then counting.\n\n\n\nIncluding the Words Themselves\nI want to be respectful of the author’s copyright and to stay well on the side of fair use. I am not a lawyer, let alone one specialized in these matters, so my current rule is that I will not include stretches of text in the data files I offer here.\nAcross large enough chunks of text, I will share list of words that have been tokenized but at the level of individual lines of dialog included in this data file, I’m not comfortable doing that. If you have suggestions on how to group the lines before tokenizing, please create an issue on the project’s GitHub repo, or start a conversation in the Discussions area.\n\nTidy datasets are easy to manipulate, model and visualize, and have a specific structure: each variable is a column, each observation is a row, and each type of observational unit is a table. https://vita.had.co.nz/papers/tidy-data.html↩︎\nThat is, the editor has not gotten to that part of the text or has missed a line.↩︎\n",
    "preview": {},
    "last_modified": "2022-10-06T14:08:18-04:00",
    "input_file": "said-element.knit.md"
  },
  {
    "path": "tei/tei-structure/",
    "title": "TEI - High Level Structure",
    "description": "How I structured my personal digital edition of _Terra Ignota_",
    "author": [
      {
        "name": "Mathieu Glachant",
        "url": {}
      }
    ],
    "date": "2022-10-02",
    "categories": [],
    "contents": "\n\nContents\nStructure of a TEI Edition\nMetadata and Text (Required)\nStandoff (Optional)\n\nSeries As One File\nSeries vs. Novels\nContents of a Novel\n\nPutting It Together\nHigh-Level Structure\n\n\nStructure of a TEI Edition\nThis project rests on a personal digital edition of the Terra Ignota series. All of the analyses use data that ultimately come from a single file containing the text of all four books marked up in a dialect of XML called TEI1.\nThis article explains the high-level structure of that file and serves as an orientation for those interested in where the data lives in relation to the text itself. Other articles in this collection will drill down into specific XML elements from the TEI schema.\nMetadata and Text (Required)\nAll TEI documents must have the following structure:\n<TEI xmlns=\"http://www.tei-c.org/ns/1.0\">\n  <teiHeader>\n    Metadata about this Digital Edition\n  <\/teiHeader>\n  <text>\n    Ada Palmer's text(s)\n  <\/text>\n<\/TEI>\nThe root is a <TEI> node with a xmlns parameter that declares the schema. The metadata about the file itself goes into the required <teiHeader> element (sources, editorial and encoding decisions, change control, contributors, etc…) and the text(s) go into the aptly named <text> node.\nStandoff (Optional)\nI have also included an optional <standoff> node. This contains anything I want to add alongside the text to support my analysis, while keeping them separate:\n<TEI xmlns=\"http://www.tei-c.org/ns/1.0\">\n  <teiHeader>\n    Metadata about this Digital Edition\n  <\/teiHeader>\n  <standoff>\n    My many long lists of things, people, places, and events I'm tracking\n  <\/standoff>\n  <text>\n    Ada Palmer's text(s)\n  <\/text>\n<\/TEI>\nThis is particularly useful to create lists of <person>,<place>, <object>, or <event> nodes which I can then point to from within the text, e.g. each time a character is mentioned, I can mark that mention with a <persName> tag pointing to that character’s <person> entry in <standoff>, to disambiguate who is being referred to:\n<standoff>\n  <person xml:id=\"Mycroft\">\n    <name>Mycroft Canner<\/name>\n  <\/person>\n<\/standoff>\n<text>\n  ....\n  \"Where hast thou been, <persName ref=\"#Mycroft\">stray<\/persName>?\"\n  ....\n<\/text>\nSeries As One File\nI opted to group the four novels into a single file to simplify data retrieval and analysis across the series. I may change this later if the file just gets too cumbersome.\nSeries vs. Novels\nBecause Terra Ignota is a series, I have structured the contents of the top-level <text> node as a <group> node for the series containing a child <text> node for each novel. Each of these nodes has a a unique xml:id parameter we can query or point to.\n<text>\n  <group xml:id=\"TerraIgnota\">\n    <text xml:id=\"TooLikeTheLightning\"><\/text>\n    <text xml:id=\"SevenSurrenders\"><\/text>\n    <text xml:id=\"TheWillToBattle\"><\/text>\n    <text xml:id=\"PerhapsTheStars\"><\/text>\n  <\/group>\n<\/text>\nContents of a Novel\nLastly, I have broken down each novel into different nodes for the front matter, the main body of the text, and the back matter. The <front> node contains the title page, the dedication, epigraph, and permissions, the <body> node contains the chapters, and the <back> node contains the acknowledgments, author bio, etc…\n<text xml:id=\"TooLikeTheLightning\">\n  <front>\n    Dedication\n    Permissions\n    Epigraph\n    Title Page\n  <\/front>\n  <body>\n    Chapter the First\n    Chapter the Second\n    etc...\n  <\/body>\n  <back>\n    Acknowledgments\n    Author's Bio\n    Copyright Notice\n  <\/back>\n<\/text>\nPutting It Together\nHigh-Level Structure\nPutting it all together, we get the following structure against which to run our queries to extract that sweet, sweet data:\n<TEI xmlns=\"http://www.tei-c.org/ns/1.0\">\n  <teiHeader>\n    Metadata about this Digital Edition\n  <\/teiHeader>\n  <standoff>\n    My many long lists of things, people, places, and events I'm tracking\n  <\/standoff>\n  <text>\n    <group xml:id=\"TerraIgnota\">\n      <text xml:id=\"TooLikeTheLightning\">\n        <front><\/front>\n        <body><\/body>\n        <back><\/back>\n      <\/text>\n      <text xml:id=\"SevenSurrenders\">\n        <front><\/front>\n        <body><\/body>\n        <back><\/back>\n      <\/text>\n      <text xml:id=\"TheWillToBattle\">\n        <front><\/front>\n        <body><\/body>\n        <back><\/back>\n      <\/text>\n      <text xml:id=\"PerhapsTheStars\">\n        <front><\/front>\n        <body><\/body>\n        <back><\/back>\n      <\/text>\n    <\/group>\n  <\/text>\n<\/TEI>\n\nText Encoding Initiative: https://tei-c.org/↩︎\n",
    "preview": {},
    "last_modified": "2022-10-04T17:01:01-04:00",
    "input_file": {}
  }
]
